src/xmlsamples/set_parameter_values_1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
        <SOAP-ENV:Header>
                <cwmp:ID SOAP-ENV:mustUnderstand="1">50</cwmp:ID>
        </SOAP-ENV:Header>
        <SOAP-ENV:Body>
                <cwmp:SetParameterValues>
                  <ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStuct[2]">
                    <ParameterValueStruct>
                      <Name>Device.Test</Name>
                      <Value xsd:type="xsi:string">Foo</Value>
                    </ParameterValueStruct>
                    <ParameterValueStruct>
                      <Name>Device.Test.Whatever</Name>
                      <Value xsd:type="xsi:int">1</Value>
                    </ParameterValueStruct>
                  </ParameterList>
                </cwmp:SetParameterValues>
        </SOAP-ENV:Body>
</SOAP-ENV:Envelope>